backend/app/controllers/streams_controller.rb

    def index
        @streams = Stream.all
---
SELECT "streams".* FROM "streams"

    def show
        @stream = Stream.find(params[:id])
---
SELECT "streams".* FROM "streams" WHERE "streams"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @stream = Stream.create!(stream_params)
---
INSERT INTO "streams" ("created_at", "updated_at", "title", "description", "userId") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-01-26 06:43:10.146793"], ["updated_at", "2022-01-26 06:43:10.146793"], ["title", "test"], ["description", "test"], ["userId", 116884381714675914618]]